Graphviz to mermaid
