--- a/libraries/dl-streamer/docs/source/architecture_2.0/cpp_interfaces.md
+++ b/libraries/dl-streamer/docs/source/architecture_2.0/cpp_interfaces.md
@@ -72,32 +72,38 @@ and providing header-only implementation of the `Tensor` interface for various f
 
 > **CAPTION:** Memory interop diagram
 
-```graphviz
-
-digraph {
-    node[shape=record,style=filled,fillcolor=lightskyblue1]
-
-    Gst->CPU
-    Gst->DMA
-    Gst->OpenCL
-    Gst->VAAPI
-    DMA->USM
-    USM->DMA
-    DMA->OpenCL
-    OpenCL->CPU
-    OpenCL->DMA
-    CPU->OpenCV
-    OpenCL->OpenCV_UMat
-    CPU->OpenVino
-    OpenCL->OpenVino
-    OpenVino->CPU
-    VAAPI->OpenVino
-    USM->CPU
-    DMA->VAAPI
-    VAAPI->DMA
-    FFmpeg->VAAPI
-    FFmpeg->CPU
-  }
+```mermaid
+   graph TB
+   Gst(["Gst"])
+   CPU(["CPU"])
+   DMA(["DMA"])
+   OpenCL(["OpenCL"])
+   VAAPI(["VAAPI"])
+   USM(["USM"])
+   OpenCV(["OpenCV"])
+   OpenCV_UMat(["OpenCV_UMat"])
+   OpenVino(["OpenVino"])
+   FFmpeg(["FFmpeg"])
+   Gst --> CPU
+   Gst --> DMA
+   Gst --> OpenCL
+   Gst --> VAAPI
+   DMA --> USM
+   USM --> DMA
+   DMA --> OpenCL
+   OpenCL --> CPU
+   OpenCL --> DMA
+   CPU --> OpenCV
+   OpenCL --> OpenCV_UMat
+   CPU --> OpenVino
+   OpenCL --> OpenVino
+   OpenVino --> CPU
+   VAAPI --> OpenVino
+   USM --> CPU
+   DMA --> VAAPI
+   VAAPI --> DMA
+   FFmpeg --> VAAPI
+   FFmpeg --> CPU
 ```
 
 All memory mappers implemented under unified interface
@@ -142,33 +148,34 @@ to DPC++/USM is chain of the following mappers
 
 > **CAPTION:** FFmpeg to USM memory mappers chain
 
-```graphviz
-
-digraph {
-    rankdir="LR"
-    node[shape=record,style=filled,fillcolor=lightskyblue1]
-
-    USM0[label="USM (Level-zero)"]
-    USM1[label="USM (DPC++)"]
-
-    FFmpeg->VAAPI->DMA->USM0->USM1
-  }
+```mermaid
+graph LR
+   USM0(["USM (Level-zero)"])
+   USM1(["USM (DPC++)"])
+   FFmpeg(["FFmpeg"])
+   VAAPI(["VAAPI"])
+   DMA(["DMA"])
+   FFmpeg --> VAAPI
+   VAAPI --> DMA
+   DMA --> USM0
+   USM0 --> USM1
 ```
 
 and GStreamer to OpenCV UMat is chain of the following mappers
 
 > **CAPTION:** Gst to USM memory mappers chain
 
-```graphviz
-
-digraph {
-    rankdir="LR"
-    node[shape=record,style=filled,fillcolor=lightskyblue1]
-
-    UMat[label="OpenCV cv::UMat"]
-
-    Gst->VAAPI->DMA->OpenCL->UMat
-  }
+```mermaid
+graph LR
+   UMat([""OpenCV cv::UMat""])
+   Gst(["Gst"])
+   VAAPI(["VAAPI"])
+   DMA(["DMA"])
+   OpenCL(["OpenCL"])
+   Gst --> VAAPI
+   VAAPI --> DMA
+   DMA --> OpenCL
+   OpenCL --> UMat
 ```
 
 ## Abstract interfaces for C++ elements
